// შექმენით მანქანის ობიექტი რომელსაც ექნება 4 კუთვნილება: მანქანის ბრენდი, მოდელი, ამჟამინდელი სიცქარე და მაქსიმალური სიჩქარე. 
// გექნებათ 3მეთოდი 
// 1) აქსელერაციის მეთოდი რომელიც ამჟამინდელ სიცჩაქრეს ყოცველ გამოძახებაზე მოუმატებს 10ს,
// 2) შექმენით კიდევ ერთი მეთოდი დექსელარცია რომელიც ყოველ გამოძახებაზე მოაკლებდა 10ს თუკი ტოპ სიჩქარეზეა მაშინ დაპრინტეთ რომ 
// მაქსიმალურ სიჩქარეზეა და დექსელარიიცს მეთოდში თუკი სიჩქარე 0ის ტოლია დაწერეთ  რომ აღარ დაამატოს. 
// 3) დაპრინტავს ამჟამინდელ სიჩქარეს. გამოიძახეთ რამდენიმეჯერ რომ გატესტოთ მეთოდების მუშაობა და კომენტარებით ახსენით რა 
// არის ობიექტი რა არის კუთვნილება და რა არის მეთოდი. როდესაც გატესტავთ სულ ბოლოს წაშალეთ მანქანის მოდელის კუთვნილება
const vehicleObj = {
    manufacturer: 'Honda',
    model: 'Fit',
    minSpeed: 30,
    maxSpeed: 220,
    accelaration: () => {
        minSpeed += 10;
    },
    deaccelaration: () => {
        minSpeed -= 10;

        if(minSpeed == 0) {
            minSpeed -= 0;
        }
    }
}
// Object - განკუთვნილი ობიექტის აგებულება რომელსაც ააჩნია თავისი ელემენტები. უფრო მარტივად, ყველაფერი ცოცხალი თუ არა ყველა არის ობიექტი.
// მაგ. სახლი ადამიანი და ა.შ. ამ ობიექტებს გააჩნიათ თავიანთი კუთვნილება. ადამიანიც ობიექტია, ჩვენი კუთვნილებაა ჩვენივე სხეულის აგებულება:
// თავი, მკლავი, ტანი და ა.შ. ობიექტებს ასევე გააჩნიათ მეთოდები. მეთოდები არის იგივე ფუნქციები რომლებიხ გაწერილი არის ობიექტში, მათი საშვლაბეით
// შეგვიძლია ვიმუშაოთ ობიექტების კუთვნილებებზე და მათ მნიშვნელობებზე. ადამიანში შეიძლება მარტივად ითქვას ჩვენივე მოძრაობა. ხელი - ობიექტის კუთვნილება
// მისი მეთოდი კი მოძრაობაა, ჯავასკრიფტში კუთვნილების მანიპულაცია და მუშაობა მეთოდებით/ფუნქციებით.