# კოდი, რომელიც რიცხვით ან ნებისმიერ სხვა მონაცემს გაადააქცევს სტრინგად, ტექსტად
# For Example:
x = str(2)
print(2 + x) # ეს არის ერორი
# იმიტომ, ტექსტისა და რიცვხის შეკრება არის შეუძლებელი

x = str(2)
y = str(6)
print(x + y)
# გამოიტანს 26, რადგანაც ეს რიცვხები გარდაიქმნა ტექსტად, მათი შეერთებით ის გარდაიქმნება 26-ად

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
#             რიცხვითი ტიპები

x = complex(3, 6)
print(x)
# ეს ფუნქცია აბრუნებს რიცვხს რეალური რიცხვისა და წარმოსახვითი რიცხვის მითითებით
# გამოიტანს: (3+6j)
# იღებს მხოლოდ 2 არგუმენტს, არ შეიძლება 2ზე მეტი რიცხვის ჩაწერა
# როდესაც მოცემულია x = complex(3), აქ დაიპრინტება (3+0j)

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////

x = int(3.5)
print(x)
#გამოიტანს 3-ს
# ინტ ფუნქცია ამრგვალებს რიცვხვებს, და გარდაქმნის ტექსტად გადმოცემულ რიცვხს, ნამდვილ რიცვად
# რომლითაც შემდეგ შეიძლება მათემატიკური მაგალითების გაკეთება

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////

x = float(3)
print(x)
# აქ ფლოათი პირიქით, დამრგვალებულ რიცხვს გადმოგვცემს წილადის სახით,
# ანუ აქ დაიპრინტება 3.0

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
#                  "თანმიმდევრობივი" ტიპები (Sequence Types)

thislist = ["apple", "banana", "cherry"]
print(thislist)
# ეს არის სია, სიაში კი ჩაიწერება მრავალი ელემენტები
# აქ კი დაიპრინტება ["apple", "banana", "cherry"] სიის სახით ოფ ქორს

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////

thistuple = ("apple", "banana", "cherry")
print(thistuple)
# ტუპლე გვაძლევს საშვალებას რომ ერთ ცვლადში შევინახოთ მრავალი ელემენტები
# დაიპრინეტბა ("apple", "banana", "cherry")

# + ექსტრად

thistuple = ("apple",)
print(type(thistuple))
# დაიპრინტება <class 'tuple'>

#NOT a tuple
thistuple = ("apple")
print(type(thistuple))
# დაიპრინტება <class 'str'>
# ანუ type გვეუბნება თუ რა ტიპისაა ეს ცვლადი

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////

x = range(6) # 0-დან 6-ის ჩათვლით, 6 არ დაიპრინტება
for n in x:
  print(n) #    for არის იგივე ლუპ ფუნქცია

x = range(3, 20, 2) # დაიწყოს 3-დან, 20-ის ჩათვლით და იზრდებოდეს 2-ით
for n in x:
  print(n)
  # ანუ იგივე კანონზომიერება

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
#                   Mapping Type

thisdict =	{               #
  "brand": "Ford",          # დაიპრინტება:
  "model": "Mustang",       # {'brand': 'Ford', 'model': 'Mustang', 'year': 1964}
  "year": 1964              #
}
print(thisdict) 
# ეს კოდი არის dict ტიპის, ანუ იგივე ლექსიკონი ინგლისურად
# ეს კოდი გამოიყენება მასში ჩაწერილი მონაცემების შესანახად
# შეიძლება მათი შეცვლა ჩამატება, მაგრამ არ შეიძლება განმეორებადი მონაცემები

thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964,  # აქ კი არის მოცემული ორი წელი
  "year": 2020   # ტერმინალში კი დაიპრინტება ის როცხვი რომელიც ყველაზე მეტია, 
}
print(thisdict)  # ამიტომ დაიპრინტება 2020

thisdict = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}
print(thisdict["brand"]) 
# აქ ჩვენ ვპრინტავთ მოცემულ ლექსიკონში ბრენდთან მითითებული ელემენტი, ანყ ფორდი

thisdict = dict(name = "John", age = 36, country = "Norway")
print(thisdict) 
# შესაძლებელია დავწეროთ ამ სახით

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
#                   Set Types

thisset = {"apple", "banana", "cherry"}
print(thisset)
# შენიშვნა: კომპლექტების სია შეუკვეთელია, რაც ნიშნავს: ნივთები გამოჩნდება შემთხვევითი თანმიმდევრობით.
# დაიპრინტება {'cherry', 'apple', 'banana'}

thisset = set(("apple", "banana", "cherry"))
print(thisset) # ასევე ჩაიწერება ამ სახით

thisset = {"apple", "banana", "cherry", "apple"}
print(thisset)
# განმეორებადი ელემენტები იგნორდება და იპრინტება მათგან ყველაზე პირველი
# ანუ პირველ ადგილზე მყოფი

mylist = ['apple', 'banana', 'cherry']
x = frozenset(mylist)
print(x)
# გაიტინება სია, დაიპრინტება frozenset({'banana', 'apple', 'cherry'})

mylist = ['apple', 'banana', 'cherry']
x = frozenset(mylist)
x[1] = "strawberry"
print(x)
# თუ შევეცდებით ელემენტებს შევუცვალოთ ადგილი დაწერს ერორს
# რადგანაც ეს სია გაყინულია! მისი შეცვლა შეუძლებელია
#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
#
x = bytes(6)
print(x)
# დაიპრინტება b'\x00\x00\x00\x00\x00\x00'

x = bytearray(4)
print(x)
# დაიპრინტება bytearray(b'\x00\x00\x00\x00')

x = memoryview(b"print") # <memory at 0x154d492dfa00>
print(x)

#პირველი ასოს უნიკოდს გამოსახავს
print(x[0])

#მეორე ასოს უნიკოდს აბრუნებს
print(x[1])

#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////

x = None

if x is True:
  print("Do you think None is True?")
elif x is False:
  print ("Do you think None is False?")
else:
  print("None is not True, or False, None is just None...")

# None არც True არის და არც False
#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
#///////////////////////////////////////////////////////////////////////////////////////
# ცხრილი
"""
    Example	                                    Data Type	        
    x = "Hello World"	                            str	
    x = 20	                                        int	
    x = 20.5	                                    float	
    x = 1j	                                        complex	
    x = ["apple", "banana", "cherry"]	            list	
    x = ("apple", "banana", "cherry")	            tuple	
    x = range(6)	                                range	
    x = {"name" : "John", "age" : 36}	            dict	
    x = {"apple", "banana", "cherry"}	            set	
    x = frozenset({"apple", "banana", "cherry"})	frozenset	
    x = True	                                    bool	
    x = b"Hello"	                                bytes	
    x = bytearray(5)	                            bytearray	
    x = memoryview(bytes(5))	                    memoryview	
    x = None	                                    NoneType	








"""