// 1) შექმენით მასივი კონსტრუქტორით და აგრეთვე ლიტერალით, შემდეგ შეცვლაეთ კონკრეტულ ინდექსზე მდგომი მნიშვნელობა, დაბჭდეთ ინდექსების 
// გამოყენებით რომელიმე მნიშვნელობა დაბეჭდეთ კონსოლში, გამოიყენეთ push method and pop method რომ წაშალოთ და დაამატოთ მასივში ელემენტები
let numArr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

numArr[9] = 9.5;

numArr.push(10);

numArr.pop()

delete numArr[9];

// 2) შექმენით მასივი სადაც შეიტანთ 10 რიცხვს, თქვენი დავალებაა for ციკლის გამოყენებით ყველა რიცხვის ჯამის გაგება
let numArr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for(num in numArr) {
    console.log(Math.sum(numArr));
}

// 3) შექმენით სია სადაც შეიტანთ 10 სახელს, თქვენი დავალებაა ამოირჩიოთ ერთერთი სახელი და for ციკჯლის გამოყენებით დაითვალოთ 
// თუ რამდენჯერ მეორდება კონკრეტული სახელი მასივში
const arrNames = [
    'Gio',
    'Gio',
    'Gio',
    'Gio',
    'Gio',
    'Gio',
    'Gio',
    'Gio',
    'Gio',
];

for(i in arrNames) {
    if(arrNames[i].repeat() > 1) {
        const repeatedNames = 0;
        repeatedNames += i;
    }
}

// 4) შექმენით მასივი სადაც შეიტანთ 10 რიცხვს, თქვენი დავალებაა დაბეჭდოთ ის თუ კონკრეტული რიცხვი ლუწია თუ კენტი, გამოიყენეთ for ციკლი
for(num in numArr) {
    if(numArr[num] % 2 == 0) {
        console.log('luwi');
    } else {
        console.log('kenti');
    }
}

// 5) შექმენით ორი მასივი და გააერთიაეთ ისინი მეთოდის გამოყენებით
let newArr = [-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0];
newArr.push(numArr);

// 6) შექმენით მასივი სადაც შეიტანთ 15 რიცხვს თქვენი დავალებაა შექმნათ კიდევ ორი მასივი ერთში შეინახავთ ლუწებს მეორეში კი კენტებს, გამოიყენეთ
// for ციკლი რომ გადაუაროთ მთავარ მასივს და ლუწები მაგ მასივიდან დაამატოთ ლუწების მასივში ხოლო კენტები კენტებში
const newNum = [1, 2, 3, ,4 ,5, 6, 7, 8, 9, 10, 11, 12 ,13 ,14 ,15];
let luwi = [];
let kenti = [];

for(i in newNum) {
    if(i % 2 == 0) {
        luwi.push(newNum[i])
    } else {
        kenti.push(newNum[i]);
    }
}