# დავალება:
# შექმენით ფუნქცია რომელსაც გადაეცემა 3 პარამეტრი(სამკუთხედის გვერდები) 
# და დაპრინტავს "ასეთი სამკუთხედი იარსებებს", 
# ან დაპრინტავს "ასეთი სამკუთხედი ვერ იარსებებს" )


# შექმენით ფუნქცია რომელსაც გადაეცემა სამი სახელი (სამი პარამეტრი) და დაპრინტავს ამ სახელებისგან სიას ( join ან split) გაიხსენეთ
# მისწერეთ Gabrieli's Squad(ჯგუფი5)

# a + b > c
# b + c > a
# c + a > b

a = int(input())
b = int(input())
c = int(input())

if (c + a) > b and (b + c) > a and (a + b) > c:
    print("Will exist")
else:
    print("Will Not exist")
