#nums = [10, 9, 8, 7, 6, 5] ----> მოცემულია სია და ჩამოწერილია რიცხვები 
#nums[0] = nums[1] - 5            აქ ამ ხაზზე nums-ის პირველი ანუ [0] არის 10, და ეს 10 ჩანაცვლდება 9, რადგან პირველი სიაში ცვხაა,
#if 4 in nums:                     ამიტომაც ათის ნაცვლად ჩაიწწერება 9-4 ანუ 5
#    print(nums[3]) ----> ამიტომაც, იცვლება კოდი, და აქიდან გამომდინარე, თუ სია მოიცავს რიცხვ 5-ს მაშინ დაიპრინტება მესამე ანუ 7
#else:    
#    print(nums[4]) -----> ხოლო თუ სიაში არ შედის რიცხვი 5, მაშინ დაიპრინტება მე-4 რიცხვი, ანუ 6 
# აქ ისედაც 7 დაიპრინტება


#x = "hello world"
#if "world" in x:      აქიდან გამომდინარე (ამ კოდიდან) თუ სტრინგი "world" არის x-ში, დაიპრინტება "Yes"
#    print("Yes") ---> x ცვლადში წერია სტრინგი "hello world"


#nums = [1, 2, 3]
#print(not 4 in nums)
#print(4 not in nums)
#print(not 3 in nums)
#print(3 not in nums)  ------> not აბრუნებს მთლიან ფუნქციას, ანუ if True -> False და if False -> True


#fruits = ["apple", "banana", "cherry"]
#for x in fruits:
#  print(x)  ---> Output: apple banana cherry ( ესეიგი ჩამოწერს fruit სიაში ჩამოწერილ სტრინგებს )


#name = len("giorgi")  <<< ამის
#print(name)  --> ითვლის სიტყვის ასოების რაოდენობას